<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest release of WebStorm and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jotterbot.munki.WebStorm</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WebStorm</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JetBrains/WebStorm</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>WebStorm</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>WebStorm is a modern JavaScript ecosystem. It includes intelligent code completion, on-the-fly error detection, powerful navigation and refactoring for JavaScript, TypeScript, stylesheet languages, and all popular frameworks.</string>
			<key>developer</key>
			<string>JetBrains</string>
			<key>display_name</key>
			<string>WebStorm</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mosen.download.WebStorm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
